#language: ru

Функционал: Проверка сайта otus

  Сценарий: Поиск курса с названием 'Системный аналитик. Advanced'
    Пусть Открываем главную страницу в браузере chrome
    И Поиск курса с названием 'Системный аналитик. Advanced'

  Сценарий:
    Пусть Открываем главную страницу в браузере chrome
    И Получаем курсы больше или равно указанной даты '28.02.2023' и выводим информацию

  Сценарий:
    Пусть Открываем главную страницу в браузере chrome
    И Получаем курсы с наименьшим и наибольшим периодом в теме 'Тестирование'